## Pandas 학습

### 라이브러리 추가

'''python
!pip install pandas
'''

- Successfully installed... : 최초설치
- Requirement already satisfied...: 이미 설치됨

In [5]:
!pip install pandas

Requirement already satisfied: pandas in c:\dev\python312\lib\site-packages (2.2.1)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: numpy<2,>=1.26.0 in c:\dev\python312\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\dev\python312\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\dev\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\dev\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\dev\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

### 판다스 라이브러리 로딩
'''python
import pandas
'''

In [6]:
import pandas as pd

### Pandas 기본
#### DataFrame 객체
- 파이썬 2차원 리스트(배열)와 동일
- 행(row) 각 하나의 유니크 데이터 묶음
- 열(column) 유니크한 데이터의 하나하나의 특성

In [7]:
## 딕셔너리로 DataFrame 객체 생성 / 2차원 리스트와 동일하게 생성 가능
data = {'이름': ['이빵빵', '김옥지', '끼꼬'], '나이':[28, 28, 10], '지역':['서울','서울','서울']}
df = pd.DataFrame(data=data)
df

    이름  나이  지역
0  이빵빵  28  서울
1  김옥지  28  서울
2   끼꼬  10  서울

In [8]:
## 2차원 리스트 생성
data = [['이빵빵', 28, '서울', 'bbang2@naver.com', False], ['김옥지', 28, '서울', 'okz@gmail.com', False],
        ['끼꼬', 10, '서울', 'kk@naver.com', False], ['신형만', 60, '일본', 'g9@naver.com', True]]

data

[['이빵빵', 28, '서울', 'bbang2@naver.com', False],
 ['김옥지', 28, '서울', 'okz@gmail.com', False],
 ['끼꼬', 10, '서울', 'kk@naver.com', False],
 ['신형만', 60, '일본', 'g9@naver.com', True]]

In [9]:
df = pd.DataFrame(data=data, columns=['이름', '나이', '지역', 'e-mail', '결혼유무'])
df

    이름  나이  지역            e-mail   결혼유무
0  이빵빵  28  서울  bbang2@naver.com  False
1  김옥지  28  서울     okz@gmail.com  False
2   끼꼬  10  서울      kk@naver.com  False
3  신형만  60  일본      g9@naver.com   True

In [10]:
## DataFrame에서 데이터 조회 (열) - 리스트는 for문을 써야 출력가능
df['이름']

0    이빵빵
1    김옥지
2     끼꼬
3    신형만
Name: 이름, dtype: object

In [11]:
## 데이터프레임 조회 (두개 열) 
df[['이름', '나이']]

    이름  나이
0  이빵빵  28
1  김옥지  28
2   끼꼬  10
3  신형만  60

In [12]:
## 데이터프레임 행으로 조회
df.loc[0]

이름                     이빵빵
나이                      28
지역                      서울
e-mail    bbang2@naver.com
결혼유무                 False
Name: 0, dtype: object

In [13]:
## 데이터프레임 조회(행)
df.loc[[0,3]]

    이름  나이  지역            e-mail   결혼유무
0  이빵빵  28  서울  bbang2@naver.com  False
3  신형만  60  일본      g9@naver.com   True

In [14]:
# 현재 데이터 프레임 확인
df

    이름  나이  지역            e-mail   결혼유무
0  이빵빵  28  서울  bbang2@naver.com  False
1  김옥지  28  서울     okz@gmail.com  False
2   끼꼬  10  서울      kk@naver.com  False
3  신형만  60  일본      g9@naver.com   True

In [15]:
## 새 컬럼 추가
df['전화번호'] = ['010', '011', '016', '070']

In [16]:
# 추가된 데이터 프레임 확인
df

    이름  나이  지역            e-mail   결혼유무 전화번호
0  이빵빵  28  서울  bbang2@naver.com  False  010
1  김옥지  28  서울     okz@gmail.com  False  011
2   끼꼬  10  서울      kk@naver.com  False  016
3  신형만  60  일본      g9@naver.com   True  070

In [17]:
## 열 삭제 (결혼유무 열 삭제) axis = 0 : 행 / axis = 1 : 열
df.drop('결혼유무', axis=1)

    이름  나이  지역            e-mail 전화번호
0  이빵빵  28  서울  bbang2@naver.com  010
1  김옥지  28  서울     okz@gmail.com  011
2   끼꼬  10  서울      kk@naver.com  016
3  신형만  60  일본      g9@naver.com  070

In [18]:
## drop()은 삭제된 모습을 출력해줌, 완전 삭제는 inplace 옵션 사용
# inplace를 화면에 출력안됨
df.drop('결혼유무', axis=1, inplace=True) # 열로 삭제하려면 axis=1만 사용

In [19]:
# 삭제된 것을 확인
df

    이름  나이  지역            e-mail 전화번호
0  이빵빵  28  서울  bbang2@naver.com  010
1  김옥지  28  서울     okz@gmail.com  011
2   끼꼬  10  서울      kk@naver.com  016
3  신형만  60  일본      g9@naver.com  070

In [20]:
## 행 추가
df.loc[4] = ['손흥민', 32, '런던', 'son@naver.com', '010']

In [21]:
df

    이름  나이  지역            e-mail 전화번호
0  이빵빵  28  서울  bbang2@naver.com  010
1  김옥지  28  서울     okz@gmail.com  011
2   끼꼬  10  서울      kk@naver.com  016
3  신형만  60  일본      g9@naver.com  070
4  손흥민  32  런던     son@naver.com  010

In [22]:
## 행 삭제(행 번호) / 완전 삭제 시 inplace 사용 혹은 새로운 변수에 재할당
df.drop(3)
df2 = df.drop(3)
df2

    이름  나이  지역            e-mail 전화번호
0  이빵빵  28  서울  bbang2@naver.com  010
1  김옥지  28  서울     okz@gmail.com  011
2   끼꼬  10  서울      kk@naver.com  016
4  손흥민  32  런던     son@naver.com  010

In [23]:
## 행 삭제 inplace, 행 삭제는 axis=0만 사용 혹은 생략
df.drop(2, axis=0, inplace=True)

In [24]:
df

    이름  나이  지역            e-mail 전화번호
0  이빵빵  28  서울  bbang2@naver.com  010
1  김옥지  28  서울     okz@gmail.com  011
3  신형만  60  일본      g9@naver.com  070
4  손흥민  32  런던     son@naver.com  010

In [25]:
## 열 이름 변경
df.rename(columns={'전화번호' : '휴대폰'}, inplace=True)

- 데이터 프레임은 파이썬의 2차원 리스트와 동일하지만, 보다 사용하기 쉽게 만들어진 클래스이다.

#### 시리즈 객체

- 파이썬에서 1차원 리스트(배열)
- 시리즈를 그루핑 한 것이 데이터프레임
- 가장 최소단위

In [26]:
data = [28, 28, 60, 32]
srs = pd.Series(data=data)
srs

0    28
1    28
2    60
3    32
dtype: int64

In [27]:
## 데이터프레임의 한 열을 가지고 온 자료구조와 시리즈는 동일하다.
type(df['나이'])

pandas.core.series.Series

In [28]:
type(srs)

pandas.core.series.Series

In [29]:
srs = pd.Series(data=data, index=['이빵빵', '김옥지', '신형만', '손흥민'])
srs

이빵빵    28
김옥지    28
신형만    60
손흥민    32
dtype: int64

In [30]:
## 조회
srs['김옥지']

28

In [31]:
srs['이빵빵'] = 30
srs

이빵빵    30
김옥지    28
신형만    60
손흥민    32
dtype: int64

In [32]:
## 데이터프레임에서 한 행을 가져와도 시리즈.
df.loc[1]

이름                  김옥지
나이                   28
지역                   서울
e-mail    okz@gmail.com
휴대폰                 011
Name: 1, dtype: object

### 데이터 프레임 사용하기

- CSV, 엑셀파일 로드
- VS Code 플러그인, GrapeCity의 Excel Viewer 설치 필요
    - 확장 > excel 검색 > GrapeCity에서 제작한 Excel Viewer 설치

In [33]:
df_csv = pd.read_csv('./data/sample_1.csv', encoding='utf-8')
df_csv

  2019년 11월 입국객 수 Unnamed: 1 Unnamed: 2 Unnamed: 3
0            국적코드         성별       입국객수       전년동기
1             A01         남성     106320      85815
2             A01         여성     191436     125241
3             A31         남성        319        299
4             A31         여성         42         54
5             A18         남성     158912     124486
6             A18         여성     232943     163466
7           총 합계      689972        NaN        NaN
8            전년동기     499361        NaN        NaN

In [34]:
df_xls = pd.read_excel('./data/sample_1.xlsx')
df_xls

  2019년 11월 입국객 수 Unnamed: 1 Unnamed: 2 Unnamed: 3
0            국적코드         성별       입국객수       전년동기
1             A01         남성     106320      85815
2             A01         여성     191436     125241
3             A31         남성        319        299
4             A31         여성         42         54
5             A18         남성     158912     124486
6             A18         여성     232943     163466
7           총 합계      689972        NaN        NaN
8            전년동기     499361        NaN        NaN

In [53]:
df_csv = pd.read_csv('./data/sample_1.csv', encoding='utf-8', header=1, skipfooter=2, engine='python' ,usecols=[0,1,2])
df_csv

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [38]:
# openpyxl 설치
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\dev\python312\lib\site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in c:\dev\python312\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [42]:
df_xls = pd.read_excel('./data/sample_1.xlsx', header=1, skipfooter=2, usecols='A:C', sheet_name = 'Sheet1')
df_xls

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

###### 엑셀, csv는 동일한 데이터라면 csv가 훨씬 용량이 적다

In [40]:
## DF 정보확인
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   2019년 11월 입국객 수  9 non-null      object
 1   Unnamed: 1       9 non-null      object
 2   Unnamed: 2       7 non-null      object
 3   Unnamed: 3       7 non-null      object
dtypes: object(4)
memory usage: 420.0+ bytes

In [50]:
## 데이터 일부 보기(위에서부터 n=5가 기본)
df_csv.head(n=3)

  2019년 11월 입국객 수 Unnamed: 1 Unnamed: 2 Unnamed: 3
0            국적코드         성별       입국객수       전년동기
1             A01         남성     106320      85815
2             A01         여성     191436     125241

In [55]:
## 데이터 일부 보기(아래에서부터 n=5 기본)
df_csv.tail(n=3)

  국적코드  성별    입국객수
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [54]:
## 통계량 요약보기
df_csv.describe()

                입국객수
count       6.000000
mean   114995.333333
std     98105.752006
min        42.000000
25%     26819.250000
50%    132616.000000
75%    183305.000000
max    232943.000000

In [61]:
# 모두 다른 데이터를 할당가능
df_csv['기준년월'] = ['2023-10', '2023-11','2023-12','2024-01','2024-02','2024-03']

In [60]:
df_csv

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2023-10
1  A01  여성  191436  2023-11
2  A31  남성     319  2023-12
3  A31  여성      42   2024-1
4  A18  남성  158912   2024-2
5  A18  여성  232943   2024-3

In [62]:
## 하나의 데이터로 통일
df_csv['기준년월'] = '2023-12'

In [63]:
df_csv

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2023-12
1  A01  여성  191436  2023-12
2  A31  남성     319  2023-12
3  A31  여성      42  2023-12
4  A18  남성  158912  2023-12
5  A18  여성  232943  2023-12

In [71]:
## 여러 행 조회(연속)
df_csv.loc[0:3]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2023-12
1  A01  여성  191436  2023-12
2  A31  남성     319  2023-12
3  A31  여성      42  2023-12

In [74]:
## 필터링
condition =  (df_csv['국적코드'] == 'A31')
condition

0    False
1    False
2     True
3     True
4    False
5    False
Name: 국적코드, dtype: bool

In [76]:
# 국적코드가 'A31'인 행만 보여주는 필터링
df_csv[condition]

  국적코드  성별  입국객수     기준년월
2  A31  남성   319  2023-12
3  A31  여성    42  2023-12

In [80]:
## 상단의 condition 변수 만드는 부분과 사용하는 부분을 합칠 수 있음
df_csv[df_csv['성별'] == '여성']

  국적코드  성별    입국객수     기준년월
1  A01  여성  191436  2023-12
3  A31  여성      42  2023-12
5  A18  여성  232943  2023-12

In [82]:
## 입국객수가 20만 이상인 데이터 추출
df_csv[df_csv['입국객수'] >= 200_000]

  국적코드  성별    입국객수     기준년월
5  A18  여성  232943  2023-12

In [84]:
## 여러 조건을 같이 필터링
df_csv[(df_csv['성별'] == '남성') & (df_csv['입국객수'] >= 150_000)]

  국적코드  성별    입국객수     기준년월
4  A18  남성  158912  2023-12

In [86]:
## 한 열에 여러 값으로 필터링
df_csv[df_csv['국적코드'].isin(['A01', 'A31'])]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2023-12
1  A01  여성  191436  2023-12
2  A31  남성     319  2023-12
3  A31  여성      42  2023-12

In [88]:
## 위 필터링의 반대 조건
df_csv[df_csv['국적코드'].isin(['A01', 'A31']) == False]

  국적코드  성별    입국객수     기준년월
4  A18  남성  158912  2023-12
5  A18  여성  232943  2023-12

In [90]:
# 데이터프레임 df에 새 컬럼 생성
df_csv['국적명'] = ['일본', '일본', '괌', '괌', '중국', '중국']
df_csv

  국적코드  성별    입국객수     기준년월 국적명
0  A01  남성  106320  2023-12  일본
1  A01  여성  191436  2023-12  일본
2  A31  남성     319  2023-12   괌
3  A31  여성      42  2023-12   괌
4  A18  남성  158912  2023-12  중국
5  A18  여성  232943  2023-12  중국

In [93]:
## df에 인덱스를 변경
df_csv = df_csv.set_index(keys='국적명')
df_csv

    국적코드  성별    입국객수     기준년월
국적명
일본   A01  남성  106320  2023-12
일본   A01  여성  191436  2023-12
괌    A31  남성     319  2023-12
괌    A31  여성      42  2023-12
중국   A18  남성  158912  2023-12
중국   A18  여성  232943  2023-12

In [101]:
df_csv = df_csv.reset_index()
df_csv

  국적명 국적코드  성별    입국객수     기준년월
0  일본  A01  남성  106320  2023-12
1  일본  A01  여성  191436  2023-12
2   괌  A31  남성     319  2023-12
3   괌  A31  여성      42  2023-12
4  중국  A18  남성  158912  2023-12
5  중국  A18  여성  232943  2023-12

In [102]:
## 통계가 가능한 항목이 입국객수 하나뿐이다.
df_csv.describe()

                입국객수
count       6.000000
mean   114995.333333
std     98105.752006
min        42.000000
25%     26819.250000
50%    132616.000000
75%    183305.000000
max    232943.000000

In [ ]:
## 그룹화(Grouping)는 함수만으로 사용 X
## 여러 함수를 같이 사용해야 df로 출력됨
df_csv.groupby('국적명').count()

In [106]:
## 나머지 컬럼은 sum의 의미가 없음
## df에서 Dtype이 int나 float같은 수치형만 통계내는 의미가 있음.
df_csv.groupby('국적명').sum('입국객수')

       입국객수
국적명
괌       361
일본   297756
중국   391855

In [109]:
## 그룹화 후 통계함수 사용 시 동일하게 적용된다.
## median(중앙값), min(최소값), max(최대값), std(표준편차), var(분산) 등
df_csv.groupby('국적명').mean('입국객수')

         입국객수
국적명
괌       180.5
일본   148878.0
중국   195927.5

In [114]:
## 오름차순 정렬
df_csv.sort_values('입국객수')

  국적명 국적코드  성별    입국객수     기준년월
3   괌  A31  여성      42  2023-12
2   괌  A31  남성     319  2023-12
0  일본  A01  남성  106320  2023-12
4  중국  A18  남성  158912  2023-12
1  일본  A01  여성  191436  2023-12
5  중국  A18  여성  232943  2023-12

In [115]:
## 내림차순 정렬
df_csv.sort_values('입국객수', ascending = False)

  국적명 국적코드  성별    입국객수     기준년월
5  중국  A18  여성  232943  2023-12
1  일본  A01  여성  191436  2023-12
4  중국  A18  남성  158912  2023-12
0  일본  A01  남성  106320  2023-12
2   괌  A31  남성     319  2023-12
3   괌  A31  여성      42  2023-12